[
    {
      "company_name": "Amazon",
      "company_avatar": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Amazon_logo.svg",
      "job_description": "As a Software Development Engineer at Amazon, you will be responsible for designing, developing, and deploying scalable software solutions that drive efficiency and improve user experience. You will collaborate closely with product managers, UX designers, and other engineers to understand business requirements and translate them into technical specifications. Daily tasks include writing efficient, maintainable, and well-documented code, conducting code reviews, and participating in agile development sprints. You'll take ownership of critical components and ensure that they are thoroughly tested and bug-free, implementing automated tests to improve development speed. This role also involves troubleshooting and debugging applications, identifying performance bottlenecks, and suggesting ways to enhance performance. Additionally, you will work on architectural designs for new features, using your expertise to shape the future of Amazon's tech stack. As you grow in this position, you will have the opportunity to mentor junior engineers and help them succeed in their roles. You will stay updated on the latest technology trends and Amazon's engineering best practices to continuously improve software quality and deployment speed.",
      "salary": 150000,
      "place": "Seattle, WA",
      "skills": ["Java", "AWS", "Microservices", "Distributed Systems", "SQL"],
      "job_type": "Full-time",
      "work_mode": "Hybrid",
      "experience_level": "Mid Level",
      "job_title": "Software Development Engineer"
    },
    {
      "company_name": "Microsoft",
      "company_avatar": "https://upload.wikimedia.org/wikipedia/commons/4/44/Microsoft_logo.svg",
      "job_description": "As a Cloud Solutions Architect at Microsoft, you will lead clients through complex cloud transformations, designing solutions that meet their business and technical needs. This role involves working with Azure services to architect and implement scalable, secure, and cost-effective cloud environments. You will assess clients’ current infrastructure, identify key requirements, and design a migration path that minimizes disruption while maximizing cloud benefits. Additionally, you’ll be responsible for implementing security and compliance measures to protect sensitive data. Working closely with development and operations teams, you’ll guide them through the best practices for cloud infrastructure. You'll troubleshoot issues and provide support during the deployment phase, ensuring a smooth transition. Furthermore, you will develop technical documentation, architecture diagrams, and provide training sessions for client teams. This role requires a continuous commitment to learning, as you stay updated on Microsoft Azure’s evolving services and tools, ultimately becoming a trusted advisor to your clients.",
      "salary": 180000,
      "place": "Redmond, WA",
      "skills": ["Azure", "Cloud Architecture", "Networking", "Virtualization", "Security"],
      "job_type": "Full-time",
      "work_mode": "Remote",
      "experience_level": "Senior Level",
      "job_title": "Cloud Solutions Architect"
    },
    {
      "company_name": "Facebook",
      "company_avatar": "https://upload.wikimedia.org/wikipedia/commons/0/05/Facebook_Logo_%282019%29.png",
      "job_description": "As a Frontend Engineer at Facebook, you will create and maintain web applications that provide a seamless user experience to billions of users. This role involves translating UI/UX designs into responsive, accessible, and optimized code that works across browsers and devices. You will work closely with designers, backend engineers, and product managers to develop high-quality user interfaces. Responsibilities include writing modular and reusable code, performing testing to ensure functionality, and optimizing page load speed. Additionally, you’ll participate in code reviews and contribute to architectural decisions. You will stay current with frontend technology trends, integrating best practices into your work. As a member of the Facebook team, you’ll have the opportunity to innovate, explore new tools, and improve the efficiency of the development process. This position requires a deep understanding of JavaScript, React, and CSS, along with an ability to work in a fast-paced environment where product iterations happen frequently.",
      "salary": 140000,
      "place": "Menlo Park, CA",
      "skills": ["JavaScript", "React", "CSS", "HTML", "TypeScript"],
      "job_type": "Full-time",
      "work_mode": "On-site",
      "experience_level": "Mid Level",
      "job_title": "Frontend Engineer"
    },
    {
      "company_name": "Netflix",
      "company_avatar": "https://upload.wikimedia.org/wikipedia/commons/0/08/Netflix_2015_logo.svg",
      "job_description": "As a DevOps Engineer at Netflix, you will play a critical role in building and maintaining infrastructure that supports streaming services for millions of viewers worldwide. Your main responsibilities include developing and managing CI/CD pipelines, optimizing deployment processes, and ensuring system reliability. You will work closely with development teams to facilitate continuous integration and deployment, helping to streamline the release process. Additionally, you will monitor system performance, quickly identifying and resolving any issues to maintain uptime and performance. This role also involves implementing tools for system monitoring, logging, and alerting, as well as configuring and managing cloud infrastructure. You'll conduct root-cause analysis to improve system resilience and prevent future incidents. Furthermore, you will have opportunities to enhance existing workflows, automate repetitive tasks, and propose architectural improvements to scale Netflix’s infrastructure. Staying updated on the latest DevOps tools and practices will be essential, as you contribute to Netflix’s ability to deliver seamless streaming experiences.",
      "salary": 170000,
      "place": "Los Gatos, CA",
      "skills": ["Docker", "Kubernetes", "AWS", "CI/CD", "Linux"],
      "job_type": "Full-time",
      "work_mode": "Remote",
      "experience_level": "Senior Level",
      "job_title": "DevOps Engineer"
    },
    {
      "company_name": "Tesla",
      "company_avatar": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Tesla_Motors.svg",
      "job_description": "As an Embedded Systems Engineer at Tesla, you will work on cutting-edge technology for electric vehicles and energy products. Your role will involve designing, implementing, and optimizing embedded software solutions that interface with hardware components. You will work closely with hardware engineers to ensure seamless integration between software and hardware systems, focusing on performance, reliability, and safety. Key responsibilities include writing and debugging embedded code, conducting system-level tests, and optimizing software for real-time applications. You'll be responsible for troubleshooting issues in complex systems and implementing solutions to improve performance. This role requires an in-depth understanding of microcontrollers, communication protocols, and real-time operating systems. As part of the Tesla engineering team, you’ll contribute to the development of innovative solutions that advance sustainable energy.",
      "salary": 135000,
      "place": "Palo Alto, CA",
      "skills": ["C/C++", "Embedded Systems", "Microcontrollers", "Real-time Operating Systems", "I2C/SPI/UART"],
      "job_type": "Full-time",
      "work_mode": "On-site",
      "experience_level": "Mid Level",
      "job_title": "Embedded Systems Engineer"
    },
    {
      "company_name": "Apple",
      "company_avatar": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Apple_logo_black.svg",
      "job_description": "As an iOS Developer at Apple, you will create apps that redefine the user experience on iOS devices, building on Apple’s reputation for innovation and user-focused design. You’ll work with cross-functional teams to define, design, and ship new features. Your responsibilities will include developing clean, reusable, and maintainable code, optimizing application performance, and ensuring high standards of security and reliability. You will also participate in code reviews, contribute to architectural discussions, and stay updated on the latest developments in iOS. In this role, you will need a deep understanding of Swift and Objective-C, along with experience using Xcode and Apple’s suite of development tools. Your work will directly impact the lives of millions of users worldwide, contributing to the evolution of Apple’s iOS ecosystem.",
      "salary": 150000,
      "place": "Cupertino, CA",
      "skills": ["Swift", "Objective-C", "iOS Development", "UI/UX Design", "Xcode"],
      "job_type": "Full-time",
      "work_mode": "On-site",
      "experience_level": "Senior Level",
      "job_title": "iOS Developer"
    },
    {
      "company_name": "LinkedIn",
      "company_avatar": "https://upload.wikimedia.org/wikipedia/commons/c/ca/LinkedIn_logo_initials.png",
      "job_description": "As a Data Engineer at LinkedIn, you will design and implement data pipelines that allow the company to leverage data for actionable insights. You will work closely with data scientists and analysts to understand data needs and build robust pipelines for collecting, processing, and storing data. Responsibilities include optimizing ETL processes, managing data warehouses, and ensuring data integrity and quality. You will also participate in data architecture discussions, contribute to performance improvements, and implement data governance practices. This role requires a solid understanding of big data technologies and programming languages used in data engineering, such as Python, SQL, and Spark. Your work will support LinkedIn’s efforts to deliver a data-driven experience for users and businesses worldwide.",
      "salary": 145000,
      "place": "Sunnyvale, CA",
      "skills": ["Python", "SQL", "ETL", "Spark", "Data Warehousing"],
      "job_type": "Full-time",
      "work_mode": "Hybrid",
      "experience_level": "Mid Level",
      "job_title": "Data Engineer"
    },
    {
      "company_name": "Stripe",
      "company_avatar": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Stripe_Logo%2C_revised_2016.svg",
      "job_description": "As a Security Engineer at Stripe, you will work to protect user data and ensure the security of Stripe's infrastructure. You will be responsible for designing and implementing security solutions, conducting vulnerability assessments, and responding to security incidents. This role involves staying updated on the latest security threats and technologies, actively participating in risk assessments, and collaborating with engineering teams to implement secure coding practices. You’ll be involved in improving incident response protocols, automating security tasks, and performing regular security audits. Your work will be critical in maintaining the trust of Stripe’s global user base and safeguarding the platform’s integrity.",
      "salary": 165000,
      "place": "San Francisco, CA",
      "skills": ["Cybersecurity", "Incident Response", "Network Security", "Python", "Risk Assessment"],
      "job_type": "Full-time",
      "work_mode": "Remote",
      "experience_level": "Senior Level",
      "job_title": "Security Engineer"
    },
    {
      "company_name": "Salesforce",
      "company_avatar": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Salesforce.com_logo.svg",
      "job_description": "As a Product Manager at Salesforce, you will define product vision, roadmap, and requirements to bring innovative CRM solutions to customers worldwide. You’ll work with cross-functional teams to understand customer needs, market trends, and competitive landscape. Key responsibilities include defining product requirements, creating user stories, prioritizing features, and coordinating with engineering, marketing, and sales teams to deliver high-quality products. This role requires a strong understanding of SaaS products, excellent communication skills, and the ability to make data-driven decisions. As a Product Manager, you’ll be at the forefront of Salesforce’s mission to empower organizations to connect with customers in meaningful ways, making a tangible impact on business success.",
      "salary": 155000,
      "place": "San Francisco, CA",
      "skills": ["Product Management", "SaaS", "CRM", "Data Analysis", "Market Research"],
      "job_type": "Full-time",
      "work_mode": "Hybrid",
      "experience_level": "Mid Level",
      "job_title": "Product Manager"
    },
    {
      "company_name": "Infosys",
      "company_avatar": "https://upload.wikimedia.org/wikipedia/commons/5/56/Infosys_logo.svg",
      "job_description": "As a Full Stack Developer at Infosys, you will develop and maintain web applications using both frontend and backend technologies. Responsibilities include designing user interfaces, implementing server-side logic, and ensuring responsiveness and cross-platform compatibility. You will collaborate with UI/UX designers, QA teams, and other developers to build scalable, high-performance applications. Your role will involve writing clean, maintainable code, performing code reviews, and adhering to industry best practices. In addition to development, you will troubleshoot issues, debug applications, and optimize for maximum speed. You will work with technologies like React, Node.js, and SQL, and will contribute to the architecture of new features. This position requires continuous learning to stay updated on the latest trends in full-stack development.",
      "salary": 1200000,
      "place": "Bengaluru, India",
      "skills": ["React", "Node.js", "SQL", "JavaScript", "APIs"],
      "job_type": "Full-time",
      "work_mode": "On-site",
      "experience_level": "Mid Level",
      "job_title": "Full Stack Developer"
    },
    {
      "company_name": "Tata Consultancy Services (TCS)",
      "company_avatar": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Tata_Consultancy_Services_Logo.svg",
      "job_description": "As a Data Analyst at TCS, you will analyze and interpret large datasets to assist in business decision-making. Responsibilities include designing data reports, creating visualizations, and presenting insights to stakeholders. You will work with data tools and technologies, including SQL, Excel, and Power BI, to manipulate and process data effectively. This role requires attention to detail, strong analytical skills, and the ability to transform raw data into actionable insights. You will also collaborate with data engineers to build data pipelines and ensure data quality. Your work will help various departments within TCS make data-driven decisions, improving efficiency and effectiveness.",
      "salary": 900000,
      "place": "Mumbai, India",
      "skills": ["SQL", "Data Analysis", "Excel", "Power BI", "Data Visualization"],
      "job_type": "Full-time",
      "work_mode": "Hybrid",
      "experience_level": "Mid Level",
      "job_title": "Data Analyst"
    },
    {
      "company_name": "Wipro",
      "company_avatar": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Wipro_Primary_Logo_Color_RGB.svg",
      "job_description": "As a Cybersecurity Specialist at Wipro, you will help protect digital assets and prevent cyber threats. Your role includes monitoring security incidents, performing vulnerability assessments, and implementing security measures to protect data. Responsibilities involve working with cross-functional teams to understand security requirements, setting up firewalls, and monitoring for intrusions. You will also participate in incident response, identify security gaps, and improve overall network security. This position requires knowledge of threat analysis, risk management, and familiarity with security protocols. As a part of the Wipro cybersecurity team, you will have a vital role in securing client and corporate data.",
      "salary": 1300000,
      "place": "Hyderabad, India",
      "skills": ["Cybersecurity", "Firewall", "Incident Response", "Threat Analysis", "Risk Management"],
      "job_type": "Full-time",
      "work_mode": "Remote",
      "experience_level": "Senior Level",
      "job_title": "Cybersecurity Specialist"
    },
    {
      "company_name": "HCL Technologies",
      "company_avatar": "https://upload.wikimedia.org/wikipedia/commons/7/7b/HCL_Technologies_logo.svg",
      "job_description": "As a Software Engineer at HCL, you will develop software solutions for various clients in different industries. Your responsibilities include coding, debugging, and implementing software solutions based on client requirements. You will collaborate with team members to understand project goals, write efficient code, and participate in code reviews. Additionally, you will be involved in system design discussions and contribute to creating scalable applications. This role requires strong problem-solving skills, familiarity with Agile methodologies, and a good grasp of programming languages such as Java and Python. As a Software Engineer, you’ll play a crucial role in delivering high-quality software that meets HCL’s standards.",
      "salary": 1100000,
      "place": "Chennai, India",
      "skills": ["Java", "Python", "Agile", "Debugging", "Software Development"],
      "job_type": "Full-time",
      "work_mode": "On-site",
      "experience_level": "Mid Level",
      "job_title": "Software Engineer"
    },
    {
      "company_name": "Flipkart",
      "company_avatar": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Flipkart_logo.svg",
      "job_description": "As a Product Designer at Flipkart, you will create user-centered designs that enhance the shopping experience for millions of users. Your responsibilities include conducting user research, defining personas, creating wireframes, and developing high-fidelity prototypes. You will work closely with product managers, developers, and other designers to align design concepts with business goals. This role requires a deep understanding of UX/UI principles, strong attention to detail, and proficiency in design tools such as Sketch and Figma. You will conduct usability testing and iterate designs based on feedback to ensure that the product meets user needs and provides a delightful experience.",
      "salary": 1000000,
      "place": "Bengaluru, India",
      "skills": ["UI/UX Design", "Prototyping", "Sketch", "Figma", "User Research"],
      "job_type": "Full-time",
      "work_mode": "Hybrid",
      "experience_level": "Mid Level",
      "job_title": "Product Designer"
    }
  ]
  